<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml2/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en">
<head>
<title>Banco de Dados I</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>UCB</title>
	
  <!-- JS -->
<script type="text/javascript" src="../js/menuHorizontal.js"></script>	
    
    
  <!-- CSS -->
  <link type="text/css" href="../css/padroes.css" rel="stylesheet">
  <link type="text/css" href="../css/classes.css" rel="stylesheet">

</head>
<body onload="horizontal();">
<div id="geral">
	<div class="topo">
  		<div id="topo">
        		<div id="topoSuperior">
                    <div id="imgTopo"></div>
                    <span class="tituloTopo">Banco de Dados I</span>
                </div>
                
                <div id="menu">
                    <ul id="menu_dropdown" class="menubar">
                    	<li class="submenu"><a href="../index.html"><br/>Principal</a></li>
                        
                        <li class="submenu"><a href="../web-a-desenvolver.html"><br/>Bibliografia</a></li>
                        
                        <li class="submenu"><a href="../monitores/grade_monitoria_geral.htm" 
                        target="_blank"><br/>Monitoria</a></li>
                        
                        <li class="submenu"><a href="../web-a-desenvolver.html"><br/>Professores</a></li>
                        
                        <li class="submenu"><a href="http://moodle.catolicavirtual.br/login/index.php" target="_blank">Acesso ao Moodle</a></li>
                        
                        <li class="submenu"><a href="http://sae.ucb.br/" target="_blank"><br/>Acesso ao SAE</a></li>
                        
                        <li class="submenu"><a href="http://www.ucb.br/" target="_blank"><br/>Acesso &agrave; UCB</a></li>
                        
                        <li class="submenu"><a href="../informacoes/informacoes.html">Mais Informa&ccedil;&otilde;es</a></li>
                    </ul>
                </div><!-- FIM MENU-->
		</div><!-- FIM TOPOINDEX id-->
    </div><!-- FIM TOPOINDEX class-->
            
    <div class="menuvertical">   
       <div id="menuvertical">
            <ul class="vert-one">
               <li><a href="new_bancointroducao.html" class="current">Introdu&ccedil;&atilde;o</a></li>
               <li><a href="new_bancosgbd.html"> SGBD </a></li>
			   <li><a href="new_bancomodelagem.html">Modelagem de Dados</a></li>
               <li><a href="new_bancomodelo_mer.html">Mod. Entid. Relacionamento</a></li>
               <li><a href="new_bancomodelo_dados_relac.html">Mod. de Dados Relacional</a></li>
			   <li><a href="new_bancodependenciafuncional.html">Depend&ecirc;ncia Funcional</a></li>
			   <li><a href="new_banconormalizacao.html">Normaliza&ccedil;&atilde;o</a></li>
               <li><a href="new_bancoalgebrarelacional.html">&Aacute;lgebra Relacional</a></li>
			   <li><a href="exercicios/exer1_Introducao_BD1.htm" target="_blank">Exerc&iacute;cios de Introdu&ccedil;&atilde;o</a></li>
			   <li> &nbsp;</li>
       	    </ul>
        </div><!-- FIM MENU VERTICAL id-->
    </div><!-- FIM MENU VERTICAL class-->
	
    
  <div id="conteudotxt">  
    <div class="cl_conteudo_txt">
      
          <p span class="cl_conteudo_tit">Introdu&ccedil;&atilde;o</span></p>&nbsp;
          
        	<div class="cl_conteudo_img">
            	<img src="imagens/introd.jpg"/>        
        	</div>
            
            
            <p>A figura acima exemplifica o sistema de uma certa farm&aacute;cia. Nesse caso, as bases de dados dos departamentos de 
               Compra e Venda s&atilde;o "ilhas" isoladas de dados, ou seja, n&atilde;o compartilham os dados entre si. E o que isso acarreta? 
               Acontece que, desta forma, h&aacute; v&aacute;rios problemas, como: </p>&nbsp;
               
             <ul class="cl_topicos_txt">
             	
                <li>Redund&acirc;ncia de dados, pois "Nome_Produto" e "Fornecedor" se repetem nas duas bases de dados; </li>&nbsp;
               
                <li>Dificuldade na manuten&ccedil;&atilde;o dos dados: se ocorrer uma mudan&ccedil;a no nome de um preduto na base de dados de Compra, a 	                    base de dados de Venda ainda continuar&aacute; com o nome antigo at&eacute; que algu&eacute;m o mude; </li>&nbsp;
               
                <li>Falta de padroniza&ccedil;&atilde;o: o nome do fornecedor, por exemplo, pode ser digitado de forma diferente em cada registro, ou                    seja, cada base de dados tem seu pr&oacute;prio padr&atilde;o; </li>&nbsp;
               
                <li>Inconsist&ecirc;ncia dos dados: uma mesma informa&ccedil;&atilde;o se apresenta de diferentes formas nas bases de dados, isso                    geralmente &eacute; causado pela falta de padroniza&ccedil;&atilde;o; </li>&nbsp;
               
                <li>Dificuldade de acesso aos dados: isso ocorre devido aos formatos diferentes nos quais os dados se apresentam. </li>&nbsp;
			
            </ul>
            
            <p>Solu&ccedil;&atilde;o para esse problema:</p>&nbsp;
            
            <div class="cl_conteudo_img">
            	<img src="imagens/introd2.jpg"/>        
        	</div>

			<p>No banco de dados representado na figura acima, toda informa&ccedil;&atilde;o anterior se encontra aqui contida, de forma               compartilhada, assim h&aacute; apenas uma ocorr&ecirc;ncia de cada informa&ccedil;&atilde;o, assim, os problemas vistos n&atilde;o ocorrem mais.</p>&nbsp;
            
            <p>Para o gerenciamento desse banco de dados &eacute; adotado o uso de um SGBD (sistema gerenciador de banco de dados), o qual &eacute;               uma cole&ccedil;&atilde;o de programas que visa dar ao usu&aacute;rio a possibilidade de criar, manter, definir e manipular um banco de               dados.</p>&nbsp;
			
            <p>Mas afinal, o que &eacute; um banco de dados? </p>&nbsp;

			<div class="cl_conteudo_img">
            	<img src="imagens/haa.jpg"/>        
        	</div>
          
          
          	<p>Banco de dados &eacute; uma cole&ccedil;&atilde;o de dados armazenados em um computador, o qual &eacute; gerenciado por um SGBD.</p>&nbsp;
            
            <p>Entre as vantagens que um banco de dados proporciona est&atilde;o:</p>&nbsp;
            
            <ul class="cl_topicos_txt">
            	
                <li>Controle da redund&acirc;ncia: o mesmo dado n&atilde;o aparece em v&aacute;rios registros; </li>&nbsp;
                
                <li>Controle centralizado: controle do banco de dados exercido pelo SGBD; </li>&nbsp;
                
                <li>Dados compartilhados; </li>&nbsp;
                
                <li>Independ&ecirc;ncia dos dados: os dados, agora, pertencem ao banco de dados, e n&atilde;o mais aos programas; </li>&nbsp;
                
                <li>Garantia de integridade (restri&ccedil;&atilde;o de integridade); </li>&nbsp;
                
                <li>Restri&ccedil;&atilde;o a acesso n&atilde;o autorizado; </li>&nbsp;
                
                <li>Facilidade em se fazer c&oacute;pias e recupera&ccedil;&otilde;es (backup e recovery); </li>&nbsp;
                
                <li>Inconsist&ecirc;ncias s&atilde;o evitadas; </li>
                
                <li>H&aacute; uma maior privacidade/prote&ccedil;&atilde;o dos dados; </li>&nbsp;
                
                <li>H&aacute; padr&otilde;es em comum, o que facilita o interc&acirc;mbio e as migra&ccedil;&otilde;es; </li>&nbsp;
                
                <li>Otimiza&ccedil;&atilde;o do espa&ccedil;o de armazenamento; </li>&nbsp;
                
                <li>Facilidade de cria&ccedil;&atilde;o de novas aplica&ccedil;&otilde;es. </li>&nbsp;
            
            </ul>&nbsp;
            
            <p>Entretanto, em algumas situa&ccedil;&otilde;es, o uso de um banco de dados pode n&atilde;o ser vantajoso: </p>&nbsp;
            
            <ul class="cl_topicos_txt">
            	
                <li>Custos iniciais elevados em hardware, software e treinamento; </li>&nbsp;
                
                <li>Custos adicionais com seguran&ccedil;a e infraestrutura; </li>&nbsp;
                
                <li>Aplica&ccedil;&otilde;es simples; </li>
                
                <li>O acesso por m&uacute;ltiplos usu&aacute;rios aos dados n&atilde;o &eacute; necess&aacute;rio. </li>&nbsp;
                
            </ul>&nbsp;
            
            <p>Alguns conceitos tamb&eacute;m s&atilde;o importantes para se entender um banco de dados:</p>&nbsp;
            
            <ul class="cl_topicos_txt">
            
            	<li><u>Campos</u>: s&atilde;o espa&ccedil;os reservados para que seja inserido um dado. Exemplo: um campo de uma tabela; </li>
                
                <li><u>Chave</u>: seq&Uuml;&ecirc;ncia de um ou mais campos, usado(s) para pesquisa em uma tabela; </li>
                
                <div class="cl_conteudo_img">
            		<img src="imagens/chave.jpg"/>        
        		</div>            
            
                <li><u>Chave prim&aacute;ria (PK)</u>: coluna ou combina&ccedil;&atilde;o de colunas de uma tabela cujos valores distinguem uma linha 
                        das demais, na medida em que individualiza cada registro. Logo a chave prim&aacute;ria precisa ser &uacute;nica e n&atilde;o nula.
                        Um bom exemplo de chave prim&aacute;ria seria uma coluna chamada "cpf" de uma tabela de funcion&aacute;rios, j&aacute; que n&atilde;o
                        existem duas ou mais pessoas com um mesmo cpf. Considere agora a tabela abaixo: 
                        
                       <div class="cl_conteudo_img">
                            <img src="imagens/tabelaPK.jpg"/>        
                       </div>&nbsp;
                        
                 Nesse caso, a coluna cod_funcionario n&atilde;o pode ser chave prim&aacute;ria, uma vez que h&aacute; valores que se repetem, n&atilde;o permitindo             distinguir unicamente cada linha. Na coluna num_dependente ocorre a mesma situa&ccedil;&atilde;o, logo esta tamb&eacute;m n&atilde;o pode ser a chave             prim&aacute;ria. A coluna nome n&atilde;o &eacute; uma boa candidata &agrave; chave prim&aacute;ria, j&aacute; que existem v&aacute;rias pessoas com um mesmo nome. A             solu&ccedil;&atilde;o nesse caso &eacute; combinar as colunas cod_funcionario e num_dependente de forma a criar uma &uacute;nica chave prim&aacute;ria. </li>
                 &nbsp;
                <li><u>Chave secund&aacute;ria</u>: chave que pode referenciar um conjunto de registros, ou seja, ela n&atilde;o precisa ter um 
                     valor diferente para cada registro (como a chave prim&aacute;ria); </li>&nbsp;
                     
                <li><u>Chave de ordena&ccedil;&atilde;o</u>: chave usada para a ordena&ccedil;&atilde;o dos registros de um arquivo; </li>&nbsp;
                
                <li><u>Chave de acesso</u>: Chave usada para pesquisa em um arquivo;</li>&nbsp;
                
                <li><u>Chave estrangeira (FK)</u>: coluna ou combina&ccedil;&atilde;o de colunas, cujos valores s&atilde;o obrigatoriamente chaves prim&aacute;rias
                    em outras ou na pr&oacute;pria tabela. Ela representa uma liga&ccedil;&atilde;o (relacionamento) entre tabelas. N&atilde;o h&aacute; limite de 
                    quantidade para chave estrangeira. </li>&nbsp;
    
                <li><u>Chave candidata (ou alternativa)</u>: Quando duas ou mais colunas podem ser chave prim&aacute;ria, se uma delas
                    for escolhida como tal, as outras ser&atilde;o chaves candidatas. Resumindo, chave candidata &eacute; um atributo que 
                    poderia ser chave prim&aacute;ria. Exemplo: &nbsp;
    
                <div class="cl_conteudo_img">
                    <img src="imagens/tabelaChaveCandidata.jpg"/>        
                </div>&nbsp;
    
    
                Nesse caso, h&aacute; duas possibilidades para chave prim&aacute;ria (cpf e rg). Ao se escolher o rg como a chave prim&aacute;ria(PK)
                da tabela, o cpf torna-se chave candidata.
                Obs.: No exemplo anterior, a melhor escolha para PK &eacute; o rg, pois o cpf possui mais caracteres, o que
                dificulta a busca e a digita&ccedil;&atilde;o e aumenta o espa&ccedil;o de armazenamento. </li>&nbsp;
                
                <li><u>Argumento de pesquisa</u>: campo que se quer procurar, ou seja, &eacute; o valor da chave de acesso em uma pesquisa; </li>&nbsp;
                
                <li><u>Dicion&aacute;rio de dados</u>: O dicion&aacute;rio de dados nada mais &eacute; que um banco de dados que cont&eacute;m informa&ccedil;&otilde;es 
                    sobre os dados da empresa, como atributos, relacionamentos, restri&ccedil;&otilde;es, chaves, entidades etc. </li>&nbsp;
                
                <li><u>Entidade</u>: Objeto do mundo real distingu&iacute;vel de outros objetos. </li>&nbsp;
                
                <li><u>Relacionamento</u>: &Eacute; uma associa&ccedil;&atilde;o (liga&ccedil;&atilde;o) entre entidades. Pode ser classificado como: </li>&nbsp;
                
                    <ul class="cl_topicos_txt">
                    
                        <li>Bin&aacute;rio: Associa&ccedil;&atilde;o entre duas entidades. Exemplo: </li>&nbsp;
                        
                        <div class="cl_conteudo_img">
                            <img src="imagens/relacionamento.jpg"/>        
                        </div>&nbsp;
                        
                        
                        <li>Tern&aacute;rio: Associa&ccedil;&atilde;o entre duas ou mais entidades. Exemplo: </li>&nbsp;
        
                        <div class="cl_conteudo_img">
                            <img src="imagens/relacionamentoTernario.jpg"/>        
                        </div>
        
                    </ul>&nbsp;
			</ul>&nbsp;			
			
            
            <p>As pessoas que manipulam um banco de dados recebem denomina&ccedil;&otilde;es especiais. S&atilde;o elas:  </p>&nbsp;
            
            <ul class="cl_topicos_txt">

            	<li>Administrador de dados (AD): &Eacute; a pessoa que conhece bem a empresa e, por isso, &eacute; ele quem cria e 
                    mant&eacute;m o dicion&aacute;rio de dados, entre outras fun&ccedil;&otilde;es; </li>&nbsp;
                
                <li> Administrador de banco de dados (DBA): &Eacute; o especialista em SGBD que controla os dados  e aplicativos que
                     acessam o banco de dados. Tamb&eacute;m &eacute; de sua responsabilidade: elaborar o projeto f&iacute;sico do banco de dados,
                     auxiliar na constru&ccedil;&atilde;o do modelo l&oacute;gico, fazer manuten&ccedil;&otilde;es, modificar a estrutura f&iacute;sica etc; </li>&nbsp;
                     
                <li>Projetista de banco de dados: Pessoa que entende bem de engenharia de software e &eacute; respons&aacute;vel por 
                    identificar os dados que ser&atilde;o armazenados, al&eacute;m de escolher a estrutura para representar e armazenar os 
                    dados, ouvir o usu&aacute;rio para obter suas necessidades etc. </li>&nbsp;
                    
                <li>Usu&aacute;rio final: Esta classifica&ccedil;&atilde;o se divide em quatro categorias: </li>&nbsp;
                
                <ul class="cl_topicos_txt">
                
                	<li>Casual: Raramente acessa o banco de dados, por&eacute;m pode necessitar de informa&ccedil;&otilde;es diferentes a cada vez;</li>
                    
                    <li>Leigos ou param&eacute;tricos: Faz acessos constantes ao banco de dados, mas utiliza consultas padronizadas
                        testadas anteriormente; </li>&nbsp;
                    
                    <li>Sofisticados: Conhece o SGBD e o utiliza; </li>&nbsp;
                    
                    <li>Individual: Possui banco de dados pessoal e utiliza programas j&aacute; prontos. </li>&nbsp;

                
                </ul>
                
            </ul>
            
            
            <p class="cl_conteudo_subtit">Tipos de banco de dados</p>&nbsp;

			 <ul class="cl_topicos_txt">
            	<li>Banco de dados em rede (ou reticular) </li>
             </ul>&nbsp;
            
            <p>Os dados s&atilde;o colocados  em registros, os quais s&atilde;o agrupados em classes. Exemplo de banco de dados em rede: 
                    Adabas e IDMS.</p>&nbsp;
           
			
            <div class="cl_conteudo_img">
            	<img src="imagens/bdreticular.jpg"/>        
            </div>
			
			<ul class="cl_topicos_txt">
            	<li> Banco de dados hier&aacute;rquico </li>&nbsp;
             </ul>&nbsp;
           

			<p>&Eacute; representado por uma &aacute;rvore hier&aacute;rquica, onde todos os relacionamentos s&atilde;o do tipo 1:N. </p>&nbsp;

			<p>Exemplo de banco de dados hier&aacute;rquico: Arquivos e diret&oacute;rios em sistemas operacionais tipo Unix.</p>&nbsp;

            <div class="cl_conteudo_img">
            	<img src="imagens/bdhierarquico.jpg"/>        
            </div>&nbsp;
            
            <ul class="cl_topicos_txt">
            	<li>  Banco de dados textual ou multim&iacute;dia </li>&nbsp;
             </ul>&nbsp;
            
			<p>Esse tipo de banco de dados difere dos demais na medida em que neste os dados como "texto corrido" ou "som" 
               s&atilde;o tratados como qualquer outro campo chave. Desta forma, qualquer informa&ccedil;&atilde;o pode ser encontrada, at&eacute; mesmo um
               pequeno trecho de um texto! </p>&nbsp;

			<p>Exemplo de banco de dados textual ou multim&iacute;dia: PostgreSQL, BrSearch, Oracle, LightBase etc.</p>&nbsp;

 			<ul class="cl_topicos_txt">
            	<li>Banco de dados orientado a objetos </li>&nbsp;
             </ul>&nbsp;
            



			<p>Como nas linguagens de programa&ccedil;&atilde;o orientadas a objetos, a unidade de armazenamento tamb&eacute;m &eacute; o objeto, por&eacute;m 
             aqui os objetos continuam a existir ap&oacute;s a finaliza&ccedil;&atilde;o do programa, &agrave; essa caracter&iacute;stica d&aacute;-se o nome de 
             <u> persist&ecirc;ncia de objetos</u>.</p>&nbsp;
             
             <p>O sistema &eacute; organizado como uma cole&ccedil;&atilde;o de objetos que definem estruturas de dados e comportamento.</p>&nbsp;
			
            
            <p>Uma das grandes qualidades desse tipo de banco de dados &eacute; o <u>reuso</u>, onde grandes programas s&atilde;o constru&iacute;dos a
             partir de outros pr&eacute;-fabricados.</p>

			<p>Exemplo de banco de dados orientado a objetos: Jasmine, PostgreSQL etc.</p>&nbsp;

 			<div class="cl_conteudo_img">
            	<img src="imagens/bdobjeto.jpg"/>        
            </div>&nbsp;
            
            <ul class="cl_topicos_txt">
            	<li> Banco de dados relacional  </li>&nbsp;
             </ul>&nbsp;
            
            <p>Banco de dados que utiliza tabelas para representar suas rela&ccedil;&otilde;es. Cada linha da <u>tabela</u> &eacute; chamada de <u>registro</u> 
               e cada coluna chama-se <u>campo</u>. O <u>dom&iacute;nio</u> &eacute; o conjunto de valores do banco de dados.</p>&nbsp;
            
            <p>O modelo relacional representa uma tentativa de descrever um banco de dados atrav&eacute;s de conceitos
               matem&aacute;ticos simples e conhecidos (&Aacute;lgebra relacional).</p>&nbsp;
               
            <p>Exemplo de banco de dados relacional: Oracle, PostgreSQL, MySQL etc.</p>&nbsp;

                        
        	<div class="cl_conteudo_img">
            	<img src="imagens/Image4.gif"/>        
            </div>&nbsp;
			
			<p span class="cl_conteudo_tit"><u>Atividade de Fixa&ccedil;&atilde;o</u></span></p>&nbsp;
			
			<p>No intuito de fixar a aprendizagem iniciada por meio deste m&oacute;dulo, e verificar como est&aacute; sua compreens&atilde;o sobre os mesmos, s&atilde;o sugeridos alguns exerc&iacute;cios de fixa&ccedil;&atilde;o para serem resolvidos. Clique no link lateral &agrave; esquerda <b>Exerc&iacute;cios</b>, pois ser&aacute; por meio dele iniciada uma lista de exerc&iacute;cio sobre os conte&uacute;dos estudados at&eacute; este momento.</p>
<p> Boa revis&atilde;o sobre os mesmos!!</p>&nbsp;

    </div>
  </div><!-- FIM CONTEUDO-->            
</div><!-- FIM GERAL-->    
        
</body>
</html>
