<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml2/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en">
<head>
<title>Banco de Dados I</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<title>UCB</title>
	
  <!-- JS -->
<script type="text/javascript" src="../js/menuHorizontal.js"></script>	
    
    
  <!-- CSS -->
  <link type="text/css" href="../css/padroes.css" rel="stylesheet">
  <link type="text/css" href="../css/classes.css" rel="stylesheet">

</head>
<body onload="horizontal();">
<div id="geral">
	<div class="topo">
  		<div id="topo">
        		<div id="topoSuperior">
                    <div id="imgTopo"></div>
                    <span class="tituloTopo">Banco de Dados I</span>
                </div>
                
                <div id="menu">
                    <ul id="menu_dropdown" class="menubar">
                    	<li class="submenu"><a href="../index.html"><br/>Principal</a></li>
                        
                        <li class="submenu"><a href="../web-a-desenvolver.html"><br/>Bibliografia</a></li>
                        
                        <li class="submenu"><a href="../monitores/grade_monitoria_geral.htm" 
                        target="_blank"><br/>Monitoria</a></li>
                        
                        <li class="submenu"><a href="../web-a-desenvolver.html"><br/>Professores</a></li>
                        
                        <li class="submenu"><a href="http://moodle.catolicavirtual.br/login/index.php" target="_blank">Acesso ao Moodle</a></li>
                        
                        <li class="submenu"><a href="http://sae.ucb.br/" target="_blank"><br/>Acesso ao SAE</a></li>
                        
                        <li class="submenu"><a href="http://www.ucb.br/" target="_blank"><br/>Acesso &agrave; UCB</a></li>
                        
                        <li class="submenu"><a href="../informacoes/informacoes.html">Mais Informa&ccedil;&otilde;es</a></li>
                    </ul>
                </div><!-- FIM MENU-->
		</div><!-- FIM TOPOINDEX id-->
    </div><!-- FIM TOPOINDEX class-->
            
    <div class="menuvertical">   
       <div id="menuvertical">
            <ul class="vert-one">
               <li><a href="new_bancointroducao.html">Introdu&ccedil;&atilde;o</a></li>
               <li><a href="new_bancosgbd.html"> SGBD </a></li>
			   <li><a href="new_bancomodelagem.html">Modelagem de Dados</a></li>
               <li><a href="new_bancomodelo_mer.html">Mod. Entid. Relacionamento</a></li>
               <li><a href="new_bancomodelo_dados_relac.html">Mod. de Dados Relacional</a></li>
			   <li><a href="new_bancodependenciafuncional.html">Depend&ecirc;ncia Funcional</a></li>
			   <li><a href="new_banconormalizacao.html" class="current">Normaliza&ccedil;&atilde;o</a></li>
               <li><a href="new_bancoalgebrarelacional.html">&Aacute;lgebra Relacional</a></li>
			   <li><a href="exercicios/exer1_normalizacao.htm" target="_blank">Exerc&iacute;cios de Normaliza&ccedil;&atilde;o</a></li>
			   <li> &nbsp;</li>
       	    </ul>
        </div><!-- FIM MENU VERTICAL id-->
    </div><!-- FIM MENU VERTICAL class-->
	
    
  <div id="conteudotxt">  
    <div class="cl_conteudo_txt">
      
      
		<p span class="cl_conteudo_tit">Normaliza&ccedil;&atilde;o</span></p>&nbsp;
        
        <p>A normaliza&ccedil;&atilde;o tem seus conceitos fundamentados na teoria de conjuntos da 
           matem&aacute;tica, assim como a depend&ecirc;ncia funcional.</p>&nbsp; 
           
        <p>Embora existam cinco formas normais no total, na pr&aacute;tica s&oacute; s&atilde;o utilizadas 
           tr&ecirc;s.</p>&nbsp;
        
        <p>Normaliza&ccedil;&atilde;o &eacute; uma t&eacute;cnica de an&aacute;lise de dados e tabelas, que, passo a passo 
           (formas normais), analisa e substitui um conjunto de atributos de uma entidade 
           por outros. Nesse processo nenhum atributo deve ser perdido.</p>&nbsp;
        
        <p>Normalizar uma tabela (rela&ccedil;&atilde;o) &eacute; decomp&ocirc;-la, com a finalidade de eliminar 
           redund&acirc;ncias e inconsist&ecirc;ncias, deixando-a sem as anomalias de atualiza&ccedil;&atilde;o 
           (inclus&atilde;o, altera&ccedil;&atilde;o e exclus&atilde;o), como por exemplo:</p>&nbsp;
        
        <div class="cl_topicos_txt">
        
        	<li>Quando se eliminar um dado n&atilde;o exclu&iacute;-lo de todo o banco de dados ou 
                quando inclu&iacute;-lo n&atildeo ter que incluir no banco de dados inteiro; </li>&nbsp;
            <li>Atributos multivalorados (repetidos); </li>&nbsp;
            <li><u>Depend&ecirc;ncia parcial</u> (um atributo que n&atilde;o &eacute; chave prim&aacute;ria depende de 
                parte dela) em rela&ccedil;&atilde;o &agrave; chave concatenada;</li>&nbsp;
            <li>Perdas acidentais de informa&ccedil;&otilde;es;</li>&nbsp;
            <li><u>Depend&ecirc;ncia transitiva</u> (campo que n&atilde;o &eacute; chave prim&aacute;ria e depende de outro
                que tamb&eacute;m n&atilde;o &eacute;) entre atributos etc.</li>&nbsp;
           
        </div>&nbsp;
        
        
        <p>Mas por que normalizar?</p>&nbsp;
        
        <div class="cl_conteudo_img">
          	
              <img src="imagens/normali001.gif" /> &nbsp;
          
    	  </div>
          
        
        <p>&Eacute; importante normalizar para se obter uma estrutura mais simples para o 
           modelo de dados, de modo que atualiza&ccedil;&otilde;es de dados sejam mais f&aacute;ceis e econ&ocirc;micas. 
           Al&eacute;m disso, a normaliza&ccedil;&atilde;o serve tamb&eacute;m para eliminar as falhas, e principalmente 
           a "mistura" de assuntos e repeti&ccedil;&otilde;es do projeto conceitual do banco de dados.</p>&nbsp;  
        
        <p>No projeto conceitual de um banco de dados n&atilde;o se pode "misturar" os assuntos em 
           uma mesma tabela! Cada assunto deve ficar em sua pr&oacute;pria tabela.</p>&nbsp;  
        
        <p>Normalmente, ap&oacute;s a aplica&ccedil;&atilde;o das regras de normaliza&ccedil;&atilde;o, algumas tabelas acabam 
           sendo divididas em duas ou mais tabelas, o que, no final, gera um n&uacute;mero maior 
           de tabelas do que havia inicialmente. Estas tabelas dever&atilde;o conter os mesmos 
           dados da tabela original.</p>&nbsp;  
        
        <p class="cl_conteudo_subtit">1&ordf; Forma Normal</p>&nbsp;  
        
        <p>Um modelo est&aacute; na 1&ordf; forma normal se n&atilde;o possui atributos repetidos.</p>&nbsp;  
		
        <p><u>Transformando para a 1&ordf; FN:</u></p>&nbsp;  
        
        <p>Remo&ccedil;&atilde;o dos atributos repetidos, criando-se uma ou mais tabelas para herd&aacute;-los, 
           a qual ter&aacute; como parte da chave prim&aacute;ria (concatenada) a chave prim&aacute;ria da 
           entidade inicial.</p>&nbsp; 

 		<p>Exemplo:</p>&nbsp; 

 		<p>Estrutura n&atilde;o normalizada:</p>&nbsp;  
        
        <p>Arquivo de Notas Fiscais (<u>Num. NF</u>, S&eacute;rie, Data emiss&atilde;o, Cod. do Cliente, Nome do
           cliente, Endere&ccedil;o do cliente, CGC do cliente, Rela&ccedil;&atilde;o das mercadorias vendidas 
           (onde para cada mercadoria temos: C&oacute;digo da Mercadoria, Descri&ccedil;&atilde;o da Mercadoria,
            Quantidade vendida, Pre&ccedil;o de venda e Total da venda desta mercadoria) e Total 
            Geral da Nota)</p>&nbsp;  
        
        <p>Analisando a estrutura acima, observamos que existem v&aacute;rias mercadorias em uma 
           &uacute;nica Nota Fiscal, sendo portanto elementos repetitivos que dever&atilde;o ser retirados. </p>&nbsp;  
        
        <p>Como resultado desta etapa ocorre um desdobramento dos dados  em duas 
           estruturas:</p>&nbsp;  
        
        <p>Arquivo de Notas Fiscais (<u>Num. NF</u>, S&eacute;rie, Data emiss&atilde;o, C&oacute;digo do Cliente, 
           Nome Cliente, Endere&ccedil;o do cliente, CGC do cliente e Total Geral da Nota)</p>&nbsp;  
        
        <p>Arquivo de Vendas (<u>Num. NF, C&oacute;digo da Mercadoria</u>, Descri&ccedil;&atilde;o da Mercadoria, 
           Quantidade vendida, Pre&ccedil;o de venda e Total da venda desta mercadoria)</p>&nbsp;  
         
        <p>Obs. Os campos sublinhados identificam as chaves das estruturas.</p>&nbsp;  
         
        <p>Entendendo melhor:</p>&nbsp;
        
        <div class="cl_topicos_txt">
        
        	<li>Primeira estrutura (Arquivo de Notas Fiscais): Dados que comp&otilde;em a 
                estrutura original, excluindo os elementos repetitivos.</li>&nbsp;
            <li>Segundo estrutura (Arquivo de Vendas): Dados que compem os elementos 
                repetitivos da estrutura original, tendo como chave o campo chave da 
                estrutura original (Num. NF) e o campo chave da estrutura de repeti&ccedil;&atilde;o 
                (C&oacute;digo da Mercadoria).</li>&nbsp;
            
        </div>
        
        
        <p class="cl_conteudo_subtit">2&ordf; Forma Normal</p>&nbsp;
        
        <p>Um modelo est&aacute; na 2&ordf; forma normal se:</p>&nbsp;
        
        <div class="cl_topicos_txt">
        	
            <li>Estiver na 1&ordf; Forma Normal;</li>&nbsp;
            <li>Cada uma das colunas n&atilde;o pertencentes &agrave; chave prim&aacute;ria dependem totalmente 
                da chave (e n&atilde;o de um subconjunto de chave).</li>&nbsp;
            <li>Depend&ecirc;ncia funcional Total (completa – chaves concatenada), Parcial e
                Transitiva.</li>&nbsp;
          
        </div>
        
        <p><u>Transformando para a 2&ordf; FN:</u></p>&nbsp;
        
        <div class="cl_topicos_txt">
        	
            <li>Remo&ccedil;&atilde;o das  depend&ecirc;ncias parciais de parte da chave prim&aacute;ria;</li>&nbsp;
            <li>Identificar as colunas que n&atilde;o participam da chave prim&aacute;ria da tabela.</li>&nbsp;
            <li>Para cada coluna, analisar se seu valor &eacute; dependente em parte ou na totalidade 
                da chave.</li>&nbsp;
			<li>Para colunas dependentes parcialmente, criar novas tabelas e excluir 
                as depend&ecirc;ncias parciais.</li>&nbsp;
            <li>Decomp&ocirc;r a rela&ccedil;&atilde;o em duas ou mais rela&ccedil;&otilde;es.</li>&nbsp;
                      
        </div>
        
        <p>Continuando ainda com a estrutura do exemplo anterior, sua 2&ordf; Forma Normal ser&aacute;:</p>&nbsp;
        
        <p>Arquivo de Notas Fiscais (<u>Num. NF</u>, S&eacute;rie, Data emiss&atilde;o, C&oacute;digo do Cliente, 
           Nome do cliente, Endere&ccedil;o do cliente, CGC do cliente e Total Geral da Nota)</p>&nbsp;  
        
        <p>Arquivo de Vendas (<u>Num. NF, C&oacute;digo da Mercadoria</u>, Quantidade vendida e Total da 
           venda desta mercadoria)</p>&nbsp;
        
        <p>Arquivo de Mercadorias (<u>C&oacute;digo da Mercadoria</u>, Descri&ccedil;&atilde;o da Mercadoria, 
           Pre&ccedil;o de venda)</p>&nbsp;
        
        <p>Ou seja, como resultado desta etapa, houve um desdobramento do arquivo de Vendas
           (o arquivo de Notas Fiscais, n&atilde;o foi alterado, por n&atilde;o possuir chave composta) em 
           duas estruturas:</p>&nbsp;
        
        <div class="cl_topicos_txt">
        	
            <li>Primeira estrutura (Arquivo de Vendas): Cont&eacute;m os elementos originais, 
               sendo exclu&iacute;dos os dados que s&atilde;o dependentes apenas do campo C&oacute;digo da 
               Mercadoria.</li>&nbsp;
            <li>Segundo estrutura (Arquivo de Mercadorias): Cont&eacute;m os elementos que s&atilde;o
                identificados apenas pelo C&oacute;digo da Mercadoria, ou seja, independentemente
                 da Nota Fiscal, a descri&ccedil;&atilde;o e o pre&ccedil;o de venda ser&atilde;o constantes.</li>&nbsp;
                      
        </div>
        
        
        <p class="cl_conteudo_subtit">3&ordf; Forma Normal</p>&nbsp; 
        
        <p>Um modelo est&aacute; na 3&ordf; forma normal se:</p>&nbsp; 
        
        <div class="cl_topicos_txt">
        	
            <li>Estiver na 2&ordf; Forma Normal;</li>&nbsp;
            <li>Os atributos (coluna) que n&atilde;o pertencem &agrave; chave n&atilde;o dependem de nenhum 
                atributo que tamb&eacute;m n&atilde;o pertence &agrave; chave.</li>&nbsp;
            <li>Depend&ecirc;ncia transitiva.</li>&nbsp;
                      
        </div>
        
        <p><u>Transformando para a 3&ordf; FN:</u></p>&nbsp; 
        
        <div class="cl_topicos_txt">
        	
            <li>Remo&ccedil;&atilde;o das  depend&ecirc;ncias transitivas;</li>&nbsp;
            <li>Identificar as colunas que n&atilde;o participam da chave prim&aacute;ria da tabela;</li>&nbsp;
            <li>Para cada coluna, analisar se seu valor &eacute; dependente de alguma coluna que n&atilde;o 
            	seja chave.</li>&nbsp;
            <li>Para colunas dependentes transitivamente, criar novas tabelas e excluir 
                as depend&ecirc;ncias transitivas</li>&nbsp;
                      
        </div>
        
        <p>Ainda com o exemplo anterior, sua 3&ordf; Forma normal ficar&aacute;:</p>&nbsp; 
        
        <p>Arquivo de Notas Fiscais (<u>Num. NF</u>, S&eacute;rie, Data emiss&atilde;o, C&oacute;digo do Cliente e Total
           Geral da Nota)</p>&nbsp; 
        
        <p>Arquivo de Vendas (<u>Num. NF, C&oacute;digo da Mercadoria</u>, Quantidade vendida e Total da 
           venda desta mercadoria)</p>&nbsp; 
        
        <p>Arquivo de Mercadorias (<u>C&oacute;digo da Mercadoria</u>, Descri&ccedil;&atilde;o da Mercadoria, Pre&ccedil;o de 
           venda)</p>&nbsp; 
        
        <p>Arquivo de Clientes (<u>C&oacute;digo do Cliente</u>, Nome do cliente, Endere&ccedil;o do cliente e CGC 
           do cliente)</p>&nbsp; 
        
        <p>Como resultado desta etapa, houve um desdobramento do arquivo de Notas Fiscais, 
           por ser o &uacute;nico que possu&iacute;a campos que n&atilde;o eram dependentes da chave principal 
           (Num. NF), uma vez que independente da Nota Fiscal, o Nome, Endere&ccedil;o e CGC do 
           cliente s&atilde;o inalterados. Este procedimento permite evitar inconsist&ecirc;ncia nos
           dados dos arquivos e economizar espa&ccedil;o por eliminar o armazenamento freqüente e 
           repetidas vezes destes dados. A cada nota fiscal comprada pelo cliente, haver&aacute; o
            armazenamento destes dados e poder&aacute; ocorrer diverg&ecirc;ncia entre eles.</p>&nbsp; 
            
        <p>As estruturas alteradas foram:</p>&nbsp; 
        
        <div class="cl_topicos_txt">
        	
            <li>Primeira estrutura (Arquivo de Notas Fiscais): Cont&eacute;m os elementos 
                originais, sendo exclu&iacute;do os dados que s&atilde;o dependentes apenas do campo 
                C&oacute;digo do Cliente (informa&ccedil;&otilde;es referentes ao cliente).</li>&nbsp;
            <li>Segundo estrutura (Arquivo de Clientes): Cont&eacute;m os elementos que s&atilde;o
                identificados apenas pelo C&oacute;digo do Cliente, ou seja, independente da Nota 
                Fiscal, o Nome, Endere&ccedil;o e CGC dos clientes ser&atilde;o constantes.</li>&nbsp;
                      
        </div>
        
       
            
		<p span class="cl_conteudo_tit"><u>Atividade de Fixa&ccedil;&atilde;o</u></span></p>&nbsp;
			
			<p>No intuito de fixar a aprendizagem iniciada por meio deste m&oacute;dulo, e verificar como est&aacute; sua compreens&atilde;o sobre os mesmos, s&atilde;o sugeridos alguns exerc&iacute;cios de fixa&ccedil;&atilde;o para serem resolvidos. Clique no link lateral &agrave; esquerda <b>Exerc&iacute;cios</b>, pois ser&aacute; por meio dele iniciada uma lista de exerc&iacute;cio sobre os conte&uacute;dos estudados at&eacute; este momento.</p>
<p> Boa revis&atilde;o sobre os mesmos!!</p>&nbsp;
          
    </div>
  </div><!-- FIM CONTEUDO-->            
</div><!-- FIM GERAL-->    
        
</body>
</html>
